import React from "react";

const InstructionsScreen = () => {
  return (
    <div className="instruction-holder">
      <div className="bg"></div>
      <div className="instructionsScreen">
        <p>
          ВЕЛО МЕМОРИЈА претставува едукативна игра преку која децата на
          едноставен и забавен начин ги изучуват велосипедските делови. Правила:
          ВЕЛО МЕМОРИЈА е игра составена од различен број на карти, кои се
          состојат од разни велосипедски делови. Играта започнува со бирање на
          лесно, средно или тешко ниво. Откога ќе го изберете посакуваното ниво,
          играта започнува, со што на вашиот екран ќе се појави и мерач на
          време. Играчот одбира една карта и со клик на истата ја врти од
          предната страна на која се наоѓа велосипедски дел. Потоа играчот со
          клик на глувчето отвора уште една карта. Ако двете избрани и отворени
          карти се исти остануваат отворени, а доколку не се исти тогаш се
          затвораат за кратко време а играчот треба да продолжи со отворање на
          нови карти. Играта завршува кога сите карти се отворени, односно
          споени во парови. Кога играта ќе заврши ќе се појави времето за кое
          играта е завршена, и бројот на потези кои сте ги направиле за да ја
          завршите. Со среќа!
        </p>
      </div>
    </div>
  );
};

export default InstructionsScreen;